It's probably also worth mentioning the very new (since 4.56.0) [`aws_vpc_security_group_ingress_rule`](https://registry.terraform.io/providers/-/aws/latest/docs/resources/vpc_security_group_ingress_rule) and [`aws_vpc_security_group_egress_rule`](https://registry.terraform.io/providers/-/aws/latest/docs/resources/vpc_security_group_egress_rule) resources which should help quite a lot with issues like this as it manages rules individually rather than as an entire 'block'.

e.g.

```hcl
resource "aws_vpc_security_group_ingress_rule" "test" {
  for_each          = toset(local.ips)
  security_group_id = aws_security_group.test.id
  ip_protocol       = "tcp"
  cidr_ipv4         = each.value
  from_port         = 8080
  to_port           = 8080
}
```

On an initial run, that'll create 60 individual SG rules, mapping 1:1 with exactly what you see in the AWS console. On the 2nd run, setting `num_rules` to `61`, you now get this behaviour:

```
$ TF_VAR_num_rules=61 terraform apply
... # skipped showing over 60 lines of output here!
Terraform will perform the following actions:

  # aws_vpc_security_group_ingress_rule.test["172.16.0.62/32"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "test" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "172.16.0.62/32"
      + from_port              = 8080
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = "sg-0d50eabaacdda46a2"
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 8080
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_vpc_security_group_ingress_rule.test["172.16.0.62/32"]: Creating...
╷
│ Error: creating VPC Security Group Rule
│ 
│   with aws_vpc_security_group_ingress_rule.test["172.16.0.62/32"],
│   on vpc.tf line 31, in resource "aws_vpc_security_group_ingress_rule" "test":
│   31: resource "aws_vpc_security_group_ingress_rule" "test" {
│ 
│ RulesPerSecurityGroupLimitExceeded: The maximum number of rules per security group has been reached.
│ 	status code: 400, request id: e019f0f0-546f-44dc-8c3c-5e3a118e5618
╵
```

That out of the box behaviour is _so_ much nicer than the older `aws_security_group_rule`. It's still not perfect as it could still lead to disruption, e.g. if your plan shows 1 deletion and 2 additions, but those `precondition`s can still be used to provide additional protection if required.